// Даны два числа. Показать большее и меньшее число

int A = 10;
int B = 12;
if (A>B)
{
Console.WriteLine("большее число " + A);
Console.WriteLine("меньшее число " + B);
}
else {
 Console.WriteLine("большее число " + B);
Console.WriteLine("меньшее число " + A);   
}

